РП/src/InformationRegisters/ДоговорыУчастниковКонтролируемыхОпераций/ДоговорыУчастниковКонтролируемыхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорыУчастниковКонтролируемыхОпераций</name>
  <resources>
    <name>КодНаименованияОперации</name>
    <comment>Додаток 4 порядку складання звіту про контрольовані операції - 001-036</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодСтороныОперации</name>
    <comment>Додаток 5 порядку складання звіту про контрольовані операції - 001-045</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УсловиеПоставкиПоИнкотермс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоПоставкиПоИнкотермс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/InformationRegisters/ДоговорыУчастниковКонтролируемыхОпераций/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СписокКодов = КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыНаименованияОпераций();
	Для каждого ЭлементСпискаКодов Из СписокКодов Цикл
		Элементы.КодНаименованияОперации.СписокВыбора.Добавить(ЭлементСпискаКодов.Значение, ЭлементСпискаКодов.Представление);
	КонецЦикла;

	СписокКодов = КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыСтороныОпераций();
	Для каждого ЭлементСпискаКодов Из СписокКодов Цикл
		Элементы.КодСтороныОперации.СписокВыбора.Добавить(ЭлементСпискаКодов.Значение, ЭлементСпискаКодов.Представление);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ДоговорКонтрагентаПриИзмененииНаСервере(Запись.ДоговорКонтрагента, Запись.ДатаКонтракта, Запись.НомерКонтракта);
	
КонецПроцедуры

&НаКлиенте
Процедура КодНаименованияОперацииПриИзменении(Элемент)
	
	ПроверитьСоответствиеКодаСтороныОперации(Запись.КодНаименованияОперации, Запись.КодСтороныОперации);

КонецПроцедуры

&НаКлиенте
Процедура КодСтороныОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.КодСтороныОперации.СписокВыбора.Очистить();
	Для каждого ДопустимыеЗначения Из СписокВозможныхЗначенийКодовСтороны(Запись.КодНаименованияОперации) Цикл
		Элементы.КодСтороныОперации.СписокВыбора.Добавить(ДопустимыеЗначения.Значение, ДопустимыеЗначения.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КодСтороныОперацииПриИзменении(Элемент)
	
	ПроверитьСоответствиеКодаСтороныОперации(Запись.КодНаименованияОперации, Запись.КодСтороныОперации);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДоговорКонтрагентаПриИзмененииНаСервере(Договор, Дата, Номер)
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "Дата, Номер");
	Дата  = РеквизитыДоговора.Дата;
	Номер = РеквизитыДоговора.Номер;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьСоответствиеКодаСтороныОперации(КодНаимОперации, КодСторОперации)
	
	СписокВозможныхЗначений = СписокВозможныхЗначенийКодовСтороны(КодНаимОперации);
	Если СписокВозможныхЗначений.НайтиПоЗначению(КодСторОперации) = Неопределено Тогда
		КодСторОперации = "";
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокВозможныхЗначенийКодовСтороны(КодНаимОперации)

	Возврат КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыСтороныОпераций(КодНаимОперации);	

КонецФункции
